# Raise Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalEvent..::..Raise Method
ExternalEvent Class See Also
---
Instructing Revit to raise (signal) the external event.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ExternalEventRequest Raise()
```

Visual Basic
---
```text
Public Function Raise As ExternalEventRequest
```

Visual C++
---
```text
public:
ExternalEventRequest Raise()
```

# ### Return Value
The result of event raising request. If the request is 'Accepted', the event would be added to the event queue and its handler will be executed in the next event-processing cycle.
# Remarks
Revit will wait until it is ready to process the event and then it will execute its event handler by calling the Execute method. Revit processes external events only when no other commands or edit modes are currently active in Revit, which is the same policy like the one that applies to evoking external commands.
# See Also
ExternalEvent Class
Autodesk.Revit.UI Namespace